#+title: Week 7 - Folds and Monoids
** Loading exercise's files
   - Loading ~Sized~ class
     #+begin_src haskell :exports both :results output :post org-babel-haskell-formatter(*this*)
       :load "./week-7-folds-and-monoids/Sized.hs"
     #+end_src

     #+RESULTS:
     : [1 of 1] Compiling Sized            ( week-7-folds-and-monoids/Sized.hs, interpreted )
     : Ok, one module loaded.

